Revit 2027 API
DirectShapeReferenceOptions.Name Property
 The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
member Name : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: value cannot be used as a name for the direct shape reference.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace